controllers/SiteController.php

SELECT * FROM "vw_request"
---
    public function actionView_actual()
    {
        $role=0;  // Хранит признак как пользователь из ЦЕКа авторизовался нужен в дальнейшем для фильтрации данных только своего РЭСа
        if(!isset(Yii::$app->user->identity->role))
        {      $flag=0;}
        else{
            $role=Yii::$app->user->identity->role;
        }

        $searchModel = new request();
        $v = request::find()->all();
        if (count($v) > 0) {
            $dataProvider = $searchModel->search(Yii::$app->request->queryParams,$role);